Revit 2027 API
FaceToposolid.SetFaceReferences Method
 Sets the referenced faces of the face toposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFaceReferences(
	IList<Reference> faceReferences
)
Public Sub SetFaceReferences (
	faceReferences As IList(Of Reference)
)
public:
void SetFaceReferences(
	IList<Reference^>^ faceReferences
)
member SetFaceReferences :
        faceReferences : IList<Reference> -> unit
Parameters
faceReferences IList<Reference>
 The references from the massing face.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace